{
  "backend/main.mo": "Main backend actor implementing product and cart management with functions to add/retrieve products, manage cart items, and includes blob storage mixin for image handling.",
  "feature_evidence.json": "Feature evidence report documenting implementation of hero carousel, product listing, product detail, shopping cart pages, and vanguardist design aesthetic with associated files and components.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including components, pages, hooks, and configuration files for the Vanguard fashion e-commerce application.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system defining light and dark mode CSS variables for the design system, including custom brand color #a932bd.",
  "frontend/index.html": "HTML entry point for the Vanguard Fashion application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home, products, product detail, and cart pages wrapped in Layout component.",
  "frontend/src/components/CartItem.tsx": "Cart item component displaying product image, details, size/color, quantity controls with increment/decrement, price calculation, and remove button.",
  "frontend/src/components/HeroCarousel.tsx": "Fullscreen auto-playing carousel with three hero slides featuring images, titles, subtitles, navigation arrows, dot indicators, and smooth fade transitions.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header navigation, Vanguard logo, menu links, cart icon with item count badge, mobile menu toggle, and footer.",
  "frontend/src/components/ProductCard.tsx": "A clickable card component that displays a product with image, name, and price, navigating to the product detail page on click.",
  "frontend/src/components/ProductGallery.tsx": "An image gallery component with thumbnail navigation that displays product images with a selected main view.",
  "frontend/src/hooks/useActor.ts": "A React hook that manages the backend actor instance, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useCart.ts": "A React hook providing cart operations (add, update, remove) and state management using a localStorage-based user ID and backend actor queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "A React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useProducts.ts": "React hooks for fetching all products or a single product by ID using TanStack Query and the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme colors using a purple/magenta color scheme.",
  "frontend/src/main.tsx": "Application entry point that sets up QueryClient, InternetIdentityProvider, and renders the root App component.",
  "frontend/src/pages/Cart.tsx": "Shopping cart page displaying cart items with quantity controls, remove functionality, and order summary with total calculation.",
  "frontend/src/pages/Home.tsx": "Homepage featuring a hero carousel, brand messaging about empowering transwomen through fashion, and three feature cards highlighting design philosophy.",
  "frontend/src/pages/ProductDetail.tsx": "Product detail page component that displays product information, image gallery, size/color selectors, and add-to-cart functionality with error and loading states.",
  "frontend/src/pages/ProductListing.tsx": "Product listing page component that displays all products in a responsive grid layout with loading skeletons and error handling.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, container settings, font families, border radius variables, and animation keyframes.",
  "project_state.json": "Project state tracking file documenting an e-commerce fashion store for transwomen with brand color #a932bd, listing completed features (carousel, product pages, cart) and architectural notes."
}