{
  "backend/main.mo": "Main backend actor implementing product catalog and shopping cart functionality with in-memory storage for products and carts, including CRUD operations and blob storage integration.",
  "feature_evidence.json": "Feature evidence report documenting two completed features: replacing Vanguard logo with TS Gabrielle logos (theme-aware) and updating all Vanguard branding references to TS Gabrielle throughout the application.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing the React application structure, components, pages, hooks, and styling for the TS Gabrielle fashion e-commerce site.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color system variables for light and dark themes with comprehensive design tokens for backgrounds, foregrounds, borders, and UI elements.",
  "frontend/index.html": "HTML entry point with page title 'TS Gabrielle Fashion' and root div for React application mounting.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home, products, product detail, and cart pages, all wrapped in the Layout component.",
  "frontend/src/components/CartItem.tsx": "Cart item component displaying product image, details, size/color, quantity controls with increment/decrement buttons, price calculation, and remove functionality.",
  "frontend/src/components/HeroCarousel.tsx": "Fullscreen auto-playing carousel with three hero slides featuring images, titles, subtitles, navigation arrows, and dot indicators with smooth transitions.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header featuring theme-aware TS Gabrielle logo (purple for light, white for dark), navigation links, cart icon with item count badge, mobile menu, and footer.",
  "frontend/src/components/ProductCard.tsx": "Reusable product card component with hover effects, product image, name, and price display that navigates to product detail page on click.",
  "frontend/src/components/ProductGallery.tsx": "React component that displays a product image gallery with a main image view and thumbnail navigation grid. Supports multiple images with selection state and highlights the active thumbnail.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the ICP backend actor instance, creating authenticated or anonymous actors based on Internet Identity state. Invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useCart.ts": "Custom hook providing cart functionality including fetching cart data, adding items, updating quantities, and removing items. Uses localStorage to persist a unique user ID and React Query for state management.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom React hook and provider for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle. Provides context for authentication status and identity access throughout the app.",
  "frontend/src/hooks/useProducts.ts": "Custom hooks for fetching product data from the backend actor using React Query. Provides useProducts for all products and useProduct for individual product lookup by ID.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a design system with light and dark mode color schemes. Uses a purple-based color palette (#a932bd) as the primary brand color.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication. Renders the main App component.",
  "frontend/src/pages/Cart.tsx": "Shopping cart page component displaying cart items with quantity controls and removal options. Shows empty state with call-to-action and calculates order total from cart items and product data.",
  "frontend/src/pages/Home.tsx": "Homepage component featuring a hero carousel, brand messaging about empowering transwomen through fashion, and three feature cards highlighting vanguardist design, artistic expression, and inclusive fashion.",
  "frontend/src/pages/ProductDetail.tsx": "Product detail page component that displays product information, image gallery, size/color selectors, and add-to-cart functionality with navigation back to product listing.",
  "frontend/src/pages/ProductListing.tsx": "Product listing page component that displays all products in a responsive grid layout with loading skeletons and error handling.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extending colors (using OKLCH color space), typography, container settings, animations, and design tokens for the application.",
  "project_state.json": "Project state tracking file documenting the e-commerce platform for transwomen fashion with brand color #a932bd, existing features including homepage carousel, product pages, shopping cart, and TS Gabrielle branding."
}