{
  "backend/main.mo": "Main backend actor implementing product management (add, get, list) and shopping cart functionality (add to cart, get cart) with in-memory storage using Maps and blob storage mixin.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: transparent header with backdrop blur, mega menu navigation, holographic effects on header elements, and holographic effects on mega menu panels.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including components, pages, hooks, and configuration files for the TS Gabrielle fashion e-commerce application.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH color system variables for light and dark themes, including custom CSS variables for UI components and base styling.",
  "frontend/index.html": "HTML entry point with page title \"TS Gabrielle Fashion\" and root div for React application mounting.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home, products, product detail, and cart pages, all wrapped in the Layout component.",
  "frontend/src/components/CartItem.tsx": "Cart item component displaying product image, details, size/color, quantity controls with increment/decrement buttons, price calculation, and remove functionality.",
  "frontend/src/components/HeroCarousel.tsx": "Fullscreen auto-playing carousel with three hero slides featuring images, titles, subtitles, navigation arrows, dot indicators, and smooth fade transitions.",
  "frontend/src/components/Layout.tsx": "Main layout component with transparent backdrop-blur header containing TS Gabrielle logo, MegaMenu navigation, animated holographic cart icon with badge, mobile menu toggle, and footer.",
  "frontend/src/components/MegaMenu.tsx": "A navigation mega menu component with hover-triggered dropdown panels for 'Home' and 'Shop' sections, featuring holographic border effects and links to various product categories and pages.",
  "frontend/src/components/ProductCard.tsx": "A clickable product card component that displays a product image, name, and price with hover effects and navigates to the product detail page on click.",
  "frontend/src/components/ProductGallery.tsx": "An image gallery component for product pages that displays a main image with thumbnail navigation, allowing users to switch between multiple product images.",
  "frontend/src/hooks/useActor.ts": "A React hook that manages the ICP actor instance based on Internet Identity authentication state, creating authenticated or anonymous actors and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useCart.ts": "A React hook providing cart functionality including fetching cart data, adding items, updating quantities, and removing items, using a localStorage-based user ID for anonymous cart management.",
  "frontend/src/hooks/useInternetIdentity.ts": "A React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and providing authentication methods with configurable AuthClient options.",
  "frontend/src/hooks/useMegaMenu.ts": "A custom hook managing mega menu state with delayed close behavior, tracking which panel is open and providing functions to open/close panels.",
  "frontend/src/hooks/useProducts.ts": "React hooks for fetching product data from the backend actor, providing both a list of all products and individual product details by ID.",
  "frontend/src/index.css": "Global CSS file defining Tailwind configuration, CSS custom properties for light/dark themes with purple/magenta color scheme, and holographic animation effects for UI elements.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/Cart.tsx": "Shopping cart page that displays cart items with product details, allows quantity updates and item removal, calculates total price, and shows an empty state with a call-to-action to explore products.",
  "frontend/src/pages/Home.tsx": "Homepage featuring a hero carousel, brand messaging about empowering transwomen fashion, a call-to-action button to explore products, and three feature cards highlighting vanguardist design, artistic expression, and inclusive fashion.",
  "frontend/src/pages/ProductDetail.tsx": "Product detail page displaying product gallery, name, price, description, size/color selectors, quantity input, and add-to-cart functionality with validation and error handling.",
  "frontend/src/pages/ProductListing.tsx": "Product listing page that displays all products in a responsive grid layout with loading skeletons, error handling, and an empty state message.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, container settings, custom font family (Inter), border radius variables, animations, and various UI component color tokens.",
  "project_state.json": "Project state file documenting an e-commerce fashion platform for transwomen with brand color #a932bd, tracking implemented features including homepage carousel, product pages, cart, vanguardist design aesthetic, TS Gabrielle branding, and holographic gradient effects."
}