{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Replace placeholder Vanguard logo with uploaded tsgabrielle brand logos for light and dark backgrounds",
  "requirements": [
    {
      "id": "REQ-8",
      "summary": "Replace the placeholder 'Vanguard' text logo in the Layout component header with the uploaded tsgabrielle logo, using the purple version for light backgrounds and the white version for dark backgrounds, with appropriate theme-based switching",
      "acceptanceCriteria": [
        "The header displays the purple tsgabrielle logo when in light mode",
        "The header displays the white tsgabrielle logo when in dark mode",
        "The logo maintains appropriate dimensions and does not distort",
        "The logo is clickable and navigates to the homepage",
        "The 'Vanguard' text is completely replaced with the logo image"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Replace the 'Vanguard' text logo with an img element that displays the tsgabrielle-logo (1).png for light mode and tsgabrielle-logo-white.png for dark mode. Implement theme detection using the prefers-color-scheme media query or Tailwind's dark mode classes. Ensure the logo is wrapped in a Link component to navigate to the homepage, maintains appropriate dimensions (constrain height to match header height while preserving aspect ratio), and is responsive across all screen sizes including mobile."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Update all references to 'Vanguard' branding throughout the application to use 'TS Gabrielle' as the brand name, including page titles, meta tags, and any text content that references the brand",
      "acceptanceCriteria": [
        "All instances of 'Vanguard' in UI text are replaced with 'TS Gabrielle'",
        "HTML title and meta tags reflect the TS Gabrielle brand name",
        "Footer and any other branded text areas use the correct brand name"
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Update the HTML title tag from 'Vanguard Fashion' to 'TS Gabrielle Fashion' and update any meta tags that reference the brand name to use 'TS Gabrielle'."
        },
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Replace any remaining text references to 'Vanguard' in the footer or other text areas with 'TS Gabrielle'. Review the footer section and any copyright or branding text to ensure consistency with the new brand name."
        },
        {
          "path": "frontend/src/pages/Home.tsx",
          "operation": "modify",
          "description": "Update any text content that references 'Vanguard' to use 'TS Gabrielle' instead. Review brand messaging, hero text, and feature descriptions to ensure all instances of the old brand name are replaced."
        }
      ]
    }
  ]
}